_Rarzrabotki/Rarus/USO2/Documents/уатШтраф.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>уатШтраф</Name>
			<Comment>(уат)</Comment>
			<BasedOn>
				<xr:Item>Document.уатПутевойЛист</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНарушения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПостановления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПостановления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаШтрафа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписанияСоглашенияНаУдержание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачиВБухгалтерию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыШтрафа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерНарушения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатХарактерыНарушений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислитсяВБазеГИБДД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплатыШтрафа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/ТекущиеКадровыеДанныеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеКадровыеДанныеСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущееПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяДолжность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновноеРабочееМестоВОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТекущаяДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТекущийВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровССотрудниками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТекущаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОформленПоТрудовомуДоговору</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТекущаяТерритория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииВыполненияРабот</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТекущаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнициалыИмени</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/уатШтраф/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.уатШтраф";
	КомандаПечати.Идентификатор = "СогласиеНаУдержание";
	КомандаПечати.Представление = НСтр("en='Agreement for withholding';ru='Согласие на удержание'");
		
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СогласиеНаУдержание") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СогласиеНаУдержание",
			"Согласие на удержание", ПечатьСогласиеНаУдержание(МассивОбъектов, ОбъектыПечати, 0));
			
	КонецЕсли;
	
	уатОбщегоНазначенияСервер.УстановитьРедактированиеПечатныхФормДокумента(КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПечатьСогласиеНаУдержание(МассивОбъектов, ОбъектыПечати, ФлагПечати = 0)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_СогласиеНаУдержание";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ПервыйДокумент = Истина;
	
	регВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СогласиеНаУдержание";
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уатШтраф.ПФ_MXL_СогласиеНаУдержание");
		
		Обл   = Макет.ПолучитьОбласть("Область");
		Обл.Параметры.СуммаШтрафа = ТекущийДокумент.СуммаШтрафа;
		Обл.Параметры.СуммаПрописью  = уатОбщегоНазначенияТиповые.уатСформироватьСуммуПрописью(ТекущийДокумент.СуммаШтрафа, регВалюта);
		
		СписокТребуемыхПараметров	= "ПолноеНаименование";
		СведенияОбОбъекте			= уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(ТекущийДокумент.Организация, ТекущийДокумент.Дата);
		Обл.Параметры.Организация	= уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(СведенияОбОбъекте, СписокТребуемыхПараметров);
		
		//мЗапрос = Новый Запрос(
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо
		//|ПОМЕСТИТЬ ВТ_ФизЛицо
		//|ИЗ
		//|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		//|			&ДатаСреза,
		//|			СтруктурнаяЕдиница = &Организация
		//|				И ОтветственноеЛицо = &ОтветственноеЛицо) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ВТ_ФизЛицо.ФизическоеЛицо.Наименование КАК Наименование,
		//|	ВТ_ФизЛицо.ФизическоеЛицо.Пол КАК Пол,
		//|	ФИОФизическихЛицСрезПоследних.Фамилия,
		//|	ФИОФизическихЛицСрезПоследних.Имя,
		//|	ФИОФизическихЛицСрезПоследних.Отчество
		//|ИЗ
		//|	ВТ_ФизЛицо КАК ВТ_ФизЛицо
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОФизическихЛицСрезПоследних
		//|		ПО ВТ_ФизЛицо.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо");
		//
		//мЗапрос.УстановитьПараметр("ДатаСреза", ТекущийДокумент.Дата);
		//мЗапрос.УстановитьПараметр("Организация", ТекущийДокумент.Организация);
		//мЗапрос.УстановитьПараметр("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		//мВыборка = мЗапрос.Выполнить().Выбрать();
		//Если мВыборка.Следующий() Тогда
		//	
		//	Если мВыборка.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
		//		мПол = 1;
		//	ИначеЕсли мВыборка.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
		//		мПол = 2;
		//	Иначе
		//		мПол = Неопределено;
		//	КонецЕсли;
		//	
		//	мРезультат = "";
		//	Если ЗначениеЗаполнено(мВыборка.Фамилия) Тогда	
		//		ОбщегоНазначения.Просклонять(СокрЛП(мВыборка.Фамилия), 3, мРезультат, мПол);
		//		мИмя = ?(ЗначениеЗаполнено(мВыборка.Имя), Лев(СокрЛП(мВыборка.Имя),1)+".", "");
		//		мОтчество = ?(ЗначениеЗаполнено(мВыборка.Отчество), Лев(СокрЛП(мВыборка.Отчество),1)+".", "");
		//		мРезультат = мРезультат + " " + мИмя + мОтчество;	
		//	Иначе
		//		ОбщегоНазначения.Просклонять(СокрЛП(мВыборка.Наименование), 3, мРезультат, мПол);		
		//	КонецЕсли;		
		//	Обл.Параметры.РуководительФИО = мРезультат;
		//	
		//КонецЕсли;
		
		мДолжность = "";
		мФИО = "";
		
		Если ЗначениеЗаполнено(ТекущийДокумент.Водитель.ФизическоеЛицо) Тогда
			
			мЗапрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
			                       |	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо,
			                       |	ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность
			                       |ПОМЕСТИТЬ ВТ_Физлицо
			                       |ИЗ
			                       |	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
			                       |ГДЕ
			                       |	ТекущиеКадровыеДанныеСотрудников.Сотрудник = &Сотрудник
			                       |	И ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = &ФизическоеЛицо
			                       |;
			                       |
			                       |////////////////////////////////////////////////////////////////////////////////
			                       |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			                       |	ВТ_Физлицо.ФизическоеЛицо.Наименование КАК Наименование,
			                       |	ВТ_Физлицо.ФизическоеЛицо.Пол КАК Пол,
			                       |	ФИОФизическихЛицСрезПоследних.Фамилия,
			                       |	ФИОФизическихЛицСрезПоследних.Имя,
			                       |	ФИОФизическихЛицСрезПоследних.Отчество,
			                       |	ВТ_Физлицо.ТекущаяДолжность КАК ТекущаяДолжность
			                       |ИЗ
			                       |	ВТ_Физлицо КАК ВТ_Физлицо
			                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОФизическихЛицСрезПоследних
			                       |		ПО ВТ_Физлицо.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо");
			
			мЗапрос.УстановитьПараметр("ДатаСреза", ТекущийДокумент.Дата);
			мЗапрос.УстановитьПараметр("Сотрудник", ТекущийДокумент.Водитель);
			мЗапрос.УстановитьПараметр("ФизическоеЛицо", ТекущийДокумент.Водитель.ФизическоеЛицо);
			мВыборка = мЗапрос.Выполнить().Выбрать();
			
			Если мВыборка.Следующий() Тогда
				
				Если мВыборка.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
					мПол = 1;
				ИначеЕсли мВыборка.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
					мПол = 2;
				Иначе
					мПол = Неопределено;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(мВыборка.Фамилия) Тогда
					ФИОПолные = мВыборка.Фамилия + " " + мВыборка.Имя + " " + мВыборка.Отчество;
					ОбщегоНазначения.Просклонять(СокрЛП(ФИОПолные), 2, мФИО, мПол);	
				Иначе
					ОбщегоНазначения.Просклонять(СокрЛП(мВыборка.Наименование), 2, мФИО, мПол);		
				КонецЕсли;
				
				мДолжность = СокрЛП(мВыборка.ТекущаяДолжность);
				Если ЗначениеЗаполнено(мДолжность) Тогда
					ОбщегоНазначения.Просклонять(мДолжность, 2, мДолжность, 1);
				КонецЕсли;
				//мДолжность = мВыборка.ТекущаяДолжность.ДолжностьРодительныйПадежь;
			Иначе
				
				мЗапрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Наименование КАК Наименование,
				|	ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность КАК ТекущаяДолжность
				|ИЗ
				|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
				|ГДЕ
				|	ТекущиеКадровыеДанныеСотрудников.Сотрудник = &Сотрудник");
				
				мЗапрос.УстановитьПараметр("Сотрудник", ТекущийДокумент.Водитель);
				мВыборка = мЗапрос.Выполнить().Выбрать();
				
				Если мВыборка.Следующий() Тогда
					ОбщегоНазначения.Просклонять(СокрЛП(мВыборка.Наименование), 2, мФИО, Неопределено);
					
					мДолжность = СокрЛП(мВыборка.ТекущаяДолжность);
					Если ЗначениеЗаполнено(мДолжность) Тогда
						ОбщегоНазначения.Просклонять(мДолжность, 2, мДолжность, 1);
					КонецЕсли;
					//мДолжность = мВыборка.ТекущаяДолжность.ДолжностьРодительныйПадежь;
								
				Иначе
					ОбщегоНазначения.Просклонять(СокрЛП(ТекущийДокумент.Водитель.Наименование), 2, мФИО, Неопределено);
				КонецЕсли;
				
			КонецЕсли;
			
			
		Иначе
			
			мЗапрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
			                       |	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Наименование КАК Наименование,
			                       |	ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность КАК ТекущаяДолжность
			                       |ИЗ
			                       |	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
			                       |ГДЕ
			                       |	ТекущиеКадровыеДанныеСотрудников.Сотрудник = &Сотрудник");
			
			мЗапрос.УстановитьПараметр("Сотрудник", ТекущийДокумент.Водитель);
			мВыборка = мЗапрос.Выполнить().Выбрать();
			
			Если мВыборка.Следующий() Тогда
				ОбщегоНазначения.Просклонять(СокрЛП(мВыборка.Наименование), 2, мФИО, Неопределено);
				
				мДолжность = СокрЛП(мВыборка.ТекущаяДолжность);
				Если ЗначениеЗаполнено(мДолжность) Тогда
					ОбщегоНазначения.Просклонять(мДолжность, 2, мДолжность, Неопределено);
				КонецЕсли;
				//мДолжность = мВыборка.ТекущаяДолжность.ДолжностьРодительныйПадежь;
				
				
			Иначе
				ОбщегоНазначения.Просклонять(СокрЛП(ТекущийДокумент.Водитель.Наименование), 2, мФИО, Неопределено);
			КонецЕсли;
				
		КонецЕсли;
		
		Обл.Параметры.ВодительФИО = мФИО;
		Обл.Параметры.ВодительДолжность = НРег(мДолжность);
		
		   
		ТабличныйДокумент.Вывести(Обл);
				
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

#КонецОбласти

#КонецЕсли
